var _city=new Array(35); 
_city[0]=new Array(["请选择省份","请先选择省份"],["请选择省份","请先选择省份"]); 
_city[1]=new Array(["北京","北京"],["北京","北京"]); 
_city[2]=new Array(["重庆","重庆"],["重庆","重庆"]); 
_city[3]=new Array(["福建","福州市","龙岩市","南平市","宁德市","莆田市","泉州市","三明市","厦门市","漳州市"],["福建","福州市","龙岩市","南平市","宁德市","莆田市","泉州市","三明市","厦门市","漳州市"]); 
_city[4]=new Array(["甘肃","白银市","定西市","甘南藏族自治州","嘉峪关市","金昌市","酒泉市","兰州市","临夏回族自治州","陇南市","平凉市","庆阳市","天水市","武威市","张掖市"],["甘肃","白银市","定西市","甘南藏族自治州","嘉峪关市","金昌市","酒泉市","兰州市","临夏回族自治州","陇南市","平凉市","庆阳市","天水市","武威市","张掖市"]); 
_city[5]=new Array(["广东","潮州市","东莞市","佛山市","广州市","河源市","惠州市","江门市","揭阳市","茂名市","梅州市","清远市","汕头市","汕尾市","韶关市","深圳市","阳江市","湛江市","肇庆市","中山市","珠海市"],["广东","潮州市","东莞市","佛山市","广州市","河源市","惠州市","江门市","揭阳市","茂名市","梅州市","清远市","汕头市","汕尾市","韶关市","深圳市","阳江市","湛江市","肇庆市","中山市","珠海市"]); 
_city[6]=new Array(["广西","百色市","北海市","桂林市","桂林市","河池市","柳州市","柳州市","南宁市","南宁市","钦州市","梧州市","梧州市","玉林市"],["广西","百色市","北海市","桂林市","桂林市","河池市","柳州市","柳州市","南宁市","南宁市","钦州市","梧州市","梧州市","玉林市"]); 
_city[7]=new Array(["贵州","安顺市","毕节市","贵阳市","六盘水市","黔东南苗族侗族自治州","黔南布依族苗族自治州","黔西南布依族苗族自治州","铜仁市","遵义市"],["贵州","安顺市","毕节市","贵阳市","六盘水市","黔东南苗族侗族自治州","黔南布依族苗族自治州","黔西南布依族苗族自治州","铜仁市","遵义市"]); 
_city[8]=new Array(["海南","白沙黎族自治县","保亭黎族苗族自治县","昌江黎族自治县","澄迈县","儋县","定安县","东方黎族自治县","海口市","乐东黎族自治县","临高县","陵水黎族自治县","南沙群岛","琼海市","琼山县","琼中黎族苗族自治县","三亚市","通什市","屯昌县","万宁县","文昌县","西沙群岛","中沙群岛的岛礁及其海域"],["海南","白沙黎族自治县","保亭黎族苗族自治县","昌江黎族自治县","澄迈县","儋县","定安县","东方黎族自治县","海口市","乐东黎族自治县","临高县","陵水黎族自治县","南沙群岛","琼海市","琼山县","琼中黎族苗族自治县","三亚市","通什市","屯昌县","万宁县","文昌县","西沙群岛","中沙群岛的岛礁及其海域"]); 
_city[9]=new Array(["安徽","安庆市","蚌埠市","巢湖市","池州市","滁州市","阜阳市","合肥市","淮北市","淮南市","黄山市","六安市","马鞍山市","宿县市","铜陵市","芜湖市","宣城市"],["安徽","安庆市","蚌埠市","巢湖市","池州市","滁州市","阜阳市","合肥市","淮北市","淮南市","黄山市","六安市","马鞍山市","宿县市","铜陵市","芜湖市","宣城市"]); 
_city[10]=new Array(["河北","保定市","保定市","沧州市","沧州市","承德市","承德市","邯郸市","邯郸市","衡水市","廊坊市","秦皇岛市","石家庄市","石家庄市","唐山市","邢台市","邢台市","张家口市","张家口市"],["河北","保定市","保定市","沧州市","沧州市","承德市","承德市","邯郸市","邯郸市","衡水市","廊坊市","秦皇岛市","石家庄市","石家庄市","唐山市","邢台市","邢台市","张家口市","张家口市"]); 
_city[11]=new Array(["河南","安阳市","鹤壁市","焦作市","开封市","洛阳市","漯河市","南阳市","平顶山市","濮阳市","三门峡市","商丘市","新乡市","信阳市","许昌市","郑州市","周口市","驻马店市"],["河南","安阳市","鹤壁市","焦作市","开封市","洛阳市","漯河市","南阳市","平顶山市","濮阳市","三门峡市","商丘市","新乡市","信阳市","许昌市","郑州市","周口市","驻马店市"]); 
_city[12]=new Array(["黑龙江","大庆市","大兴安岭市","哈尔滨市","鹤岗市","黑河市","鸡西市","佳木斯市","牡丹江市","七台河市","齐齐哈尔市","双鸭山市","松花江市","绥化市","伊春市"],["黑龙江","大庆市","大兴安岭市","哈尔滨市","鹤岗市","黑河市","鸡西市","佳木斯市","牡丹江市","七台河市","齐齐哈尔市","双鸭山市","松花江市","绥化市","伊春市"]); 
_city[13]=new Array(["湖北","鄂西土家族苗族自治州","鄂州市","黄冈市","黄石市","荆门市","荆州市","沙市市","省直辖行政单位","十堰市","武汉市","咸宁市","襄樊市","孝感市","宜昌市","郧阳市"],["湖北","鄂西土家族苗族自治州","鄂州市","黄冈市","黄石市","荆门市","荆州市","沙市市","省直辖行政单位","十堰市","武汉市","咸宁市","襄樊市","孝感市","宜昌市","郧阳市"]); 
_city[14]=new Array(["湖南","长沙市","常德市","郴州市","大庸市","衡阳市","怀化市","零陵市","娄底市","邵阳市","湘潭市","湘西土家族苗族自治州","益阳市","岳阳市","株洲市"],["湖南","长沙市","常德市","郴州市","大庸市","衡阳市","怀化市","零陵市","娄底市","邵阳市","湘潭市","湘西土家族苗族自治州","益阳市","岳阳市","株洲市"]); 
_city[15]=new Array(["吉林","白城市","长春市","浑江市","吉林市","辽源市","四平市","松原市","通化市","延边朝鲜族自治州"],["吉林","白城市","长春市","浑江市","吉林市","辽源市","四平市","松原市","通化市","延边朝鲜族自治州"]); 
_city[16]=new Array(["江苏","常州市","淮阴市","连云港市","南京市","南通市","苏州市","无锡市","徐州市","盐城市","扬州市","镇江市"],["江苏","常州市","淮阴市","连云港市","南京市","南通市","苏州市","无锡市","徐州市","盐城市","扬州市","镇江市"]); 
_city[17]=new Array(["江西","抚州市","赣州市","吉安市","景德镇市","九江市","南昌市","萍乡市","上饶市","新余市","宜春市","鹰潭市"],["江西","抚州市","赣州市","吉安市","景德镇市","九江市","南昌市","萍乡市","上饶市","新余市","宜春市","鹰潭市"]); 
_city[18]=new Array(["辽宁","鞍山市","本溪市","朝阳市","大连市","丹东市","抚顺市","阜新市","锦西市","锦州市","辽阳市","盘锦市","沈阳市","铁岭市","营口市"],["辽宁","鞍山市","本溪市","朝阳市","大连市","丹东市","抚顺市","阜新市","锦西市","锦州市","辽阳市","盘锦市","沈阳市","铁岭市","营口市"]); 
_city[19]=new Array(["内蒙古","阿拉善盟","巴彦淖尔盟","包头市","赤峰市","呼和浩特市","呼伦贝尔盟","乌海市","乌兰察布盟","锡林郭勒盟","兴安盟","伊克昭盟","哲里木盟"],["内蒙古","阿拉善盟","巴彦淖尔盟","包头市","赤峰市","呼和浩特市","呼伦贝尔盟","乌海市","乌兰察布盟","锡林郭勒盟","兴安盟","伊克昭盟","哲里木盟"]); 
_city[20]=new Array(["宁夏","固原市","石嘴山市","银川市","银南市"],["宁夏","固原市","石嘴山市","银川市","银南市"]); 
_city[21]=new Array(["青海","果洛藏族自治州","海北藏族自治州","海东市","海南藏族自治州","海西蒙古族藏族自治州","黄南藏族自治州","西宁市","玉树藏族自治州"],["青海","果洛藏族自治州","海北藏族自治州","海东市","海南藏族自治州","海西蒙古族藏族自治州","黄南藏族自治州","西宁市","玉树藏族自治州"]); 
_city[22]=new Array(["山东","滨州市","德州市","东营市","菏泽市","济南市","济宁市","莱芜市","聊城市","临沂市","青岛市","日照市","泰安市","威海市","潍坊市","烟台市","枣庄市","淄博市"],["山东","滨州市","德州市","东营市","菏泽市","济南市","济宁市","莱芜市","聊城市","临沂市","青岛市","日照市","泰安市","威海市","潍坊市","烟台市","枣庄市","淄博市"]); 
_city[23]=new Array(["山西","长治市","大同市","晋城市","晋中市","临汾市","吕梁市","朔州市","太原市","忻州市","雁北市","阳泉市","运城市"],["山西","长治市","大同市","晋城市","晋中市","临汾市","吕梁市","朔州市","太原市","忻州市","雁北市","阳泉市","运城市"]); 
_city[24]=new Array(["陕西","安康市","宝鸡市","汉中市","商洛市","铜川市","渭南市","西安市","咸阳市","延安市","榆林市"],["陕西","安康市","宝鸡市","汉中市","商洛市","铜川市","渭南市","西安市","咸阳市","延安市","榆林市"]); 
_city[25]=new Array(["上海","上海"],["上海","上海"]); 
_city[26]=new Array(["四川","阿坝藏族羌族自治州","成都市","达县市","德阳市","涪陵市","甘孜藏族自治州","广元市","乐山市","凉山彝族自治州","泸州市","绵阳市","内江市","南充市","攀枝花市","黔江市","遂宁市","万县市","雅安市","宜宾市","自贡市"],["四川","阿坝藏族羌族自治州","成都市","达县市","德阳市","涪陵市","甘孜藏族自治州","广元市","乐山市","凉山彝族自治州","泸州市","绵阳市","内江市","南充市","攀枝花市","黔江市","遂宁市","万县市","雅安市","宜宾市","自贡市"]); 
_city[27]=new Array(["台湾","台湾"],["台湾","台湾"]); 
_city[28]=new Array(["天津","天津"],["天津","天津"]); 
_city[29]=new Array(["西藏","阿里市","昌都市","拉萨市","林芝市","那曲市","日喀则市","山南市"],["西藏","阿里市","昌都市","拉萨市","林芝市","那曲市","日喀则市","山南市"]); 
_city[30]=new Array(["新疆","阿克苏市","阿勒泰市","巴音郭楞蒙古自治州","博尔塔拉蒙古自治州","昌吉回族自治州","哈密市","和田市","喀什市","克拉玛依市","克孜勒苏柯尔克孜自治州","省直辖行政单位","塔城市","吐鲁番市","乌鲁木齐市","伊犁市","伊犁哈萨克自治州"],["新疆","阿克苏市","阿勒泰市","巴音郭楞蒙古自治州","博尔塔拉蒙古自治州","昌吉回族自治州","哈密市","和田市","喀什市","克拉玛依市","克孜勒苏柯尔克孜自治州","省直辖行政单位","塔城市","吐鲁番市","乌鲁木齐市","伊犁市","伊犁哈萨克自治州"]); 
_city[31]=new Array(["云南","保山市","楚雄彝族自治州","大理白族自治州","德宏傣族景颇族自治州","迪庆藏族自治州","东川市","红河哈尼族彝族自治州","昆明市","丽江市","临沧市","怒江傈僳族自治州","曲靖市","思茅市","文山壮族苗族自治州","西双版纳傣族自治州","玉溪市","昭通市"],["云南","保山市","楚雄彝族自治州","大理白族自治州","德宏傣族景颇族自治州","迪庆藏族自治州","东川市","红河哈尼族彝族自治州","昆明市","丽江市","临沧市","怒江傈僳族自治州","曲靖市","思茅市","文山壮族苗族自治州","西双版纳傣族自治州","玉溪市","昭通市"]); 
_city[32]=new Array(["浙江","杭州市","湖州市","嘉兴市","金华市","丽水市","宁波市","衢州市","绍兴市","台州市","温州市","舟山市"],["浙江","杭州市","湖州市","嘉兴市","金华市","丽水市","宁波市","衢州市","绍兴市","台州市","温州市","舟山市"]); 
_city[33]=new Array(["港澳","香港","澳门"],["港澳","香港","澳门"]); 
_city[34]=new Array(["海外","海外"],["海外","海外"]); 
 
 
function loadProvince(id) 
{ 
 var obj=document.getElementById(id); 
 for(var i=0;i<_city.length;i++) 
 { 
  if(_city[i]) 
  { 
   obj.options[obj.length]=new Option(_city[i][0][0],_city[i][1][0]); 
  } 
 } 
} 
 
function loadCity(obj,id) 
{ 
 var obj1=document.getElementById(id); 
 var index=obj.selectedIndex; 
 obj1.length=0; 
 for(var i=1;i<_city[index][0].length;i++) 
  obj1.options[obj1.length]=new Option(_city[index][0][i],_city[index][1][i]); 
 obj1.selectedIndex=0; 
} 